Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E13B.tmx
Source language: en_us
Languages: zh_cn

source: Chicken with crispy Parma ham
zh_cn: 香煎鸡胸肉配酥脆帕尔玛火腿

source: A delicious low-fat dish in just 30 minutes, perfect if friends drop by midweek
zh_cn: 平日朋友来串门，总要会一道拿得出手的私房菜吧？

source: Ingredients
zh_cn: 食材：

source: Serves 4
zh_cn: 四人份

source: 16 oz new potatoes , halved if large
zh_cn: 16盎司小土豆，大的一切两半

source: 8 oz runner beans , trimmed and sliced
zh_cn: 8盎司四季豆，掐尖去筋切丝

source: 4 skinless chicken breasts
zh_cn: 4块去皮鸡脯肉

source: 1 tbsp olive oil
zh_cn: 1汤匙橄榄油

source: 4 slices Parma ham
zh_cn: 4片帕尔玛火腿

source: 1 garlic clove, crushed
zh_cn: 1颗大蒜瓣，切碎

source: juice 1 lemon
zh_cn: 1颗柠檬，取汁

source: Method
zh_cn: 制作做法：

source: 1.Cook the new potatoes in boiling salted water for 10-15 mins, until just tender, adding the green beans for the final 2 mins.
zh_cn: 1. 将小土豆放滚盐水烫个10-15分钟。待变软时，加入四季豆再煮2分钟。

source: Meanwhile, put each chicken breast between two sheets of cling film and bash them with a rolling pin until they're about 1cm thick. Season.
zh_cn: 同时，将鸡胸肉用保鲜膜裹好，再拿擀面杖使劲捶打，直到每片只有1cm厚，调味。

source: 2.Heat a large frying pan and add the Parma ham. Cook for 2 mins, until crisp. Drain on kitchen paper.
zh_cn: 2. 起煎锅，把火腿煎2分钟直至酥脆，再用吸油纸控油。

source: Add the oil to the pan and add two of the chicken breasts. Cook for 3 mins each side, transfer to a plate and keep warm.
zh_cn: 倒入橄榄油，加入2片鸡胸肉，每面煎约3分钟。

source: Cook the other two breasts in the same way.
zh_cn: 同样方法煎剩下2片。

source: 3.Remove the pan from the heat and add the garlic and lemon juice.
zh_cn: 3. 关火，加入蒜末和柠檬汁。

source: Toss in the drained beans and potatoes and crumble in the Parma ham.
zh_cn: 控干四季豆和土豆的水分，撒上火腿碎。

source: Divide the chicken and veg between four plates.
zh_cn: 最后把鸡肉和配菜分别盛入4个盘子。

source: Nutrition per serving
zh_cn: 营养价值：

source: 302 kcalories, protein 42.0g, carbohydrate 20.0g, fat 7.0g, saturated fat 2.0g, fibre 2.0g, salt 0.96g.
zh_cn: 卡路里：302千卡，蛋白质：42.0克，碳水化合物：20.0克，脂肪：7.0克，饱和脂肪：2.0克，纤维素：2.0克，盐：0.96克
